; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	infrared1 - mode
	infrared3 - mode
	spectrograph2 - mode
	image0 - mode
	GroundStation5 - direction
	Star1 - direction
	GroundStation6 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star1)
	(supports instrument3 spectrograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument6 image0)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star7)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet10)
)
(:goal (and
	(pointing satellite0 Planet10)
	(pointing satellite2 Star4)
	(pointing satellite3 Planet12)
	(pointing satellite4 GroundStation5)
	(have_image Planet8 infrared3)
	(have_image Star9 spectrograph2)
	(have_image Planet10 image0)
	(have_image Phenomenon11 spectrograph2)
	(have_image Planet12 infrared1)
	(have_image Star13 image0)
	(have_image Star14 image0)
))

)

; plan
1. (turn_to satellite3 planet12 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet12)
   goals met: 1 of 11
2. (turn_to satellite2 groundstation2 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 groundstation2)
   goals met: 1 of 11
3. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 11
4. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 1 of 11
5. (turn_to satellite2 planet8 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet8)
   goals met: 1 of 11
6. (take_image satellite2 planet8 instrument4 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 2 of 11
7. (turn_to satellite2 planet12 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet12)
   goals met: 2 of 11
8. (take_image satellite2 planet12 instrument4 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 3 of 11
9. (turn_to satellite2 phenomenon11 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 11
10. (turn_to satellite0 groundstation3 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 11
11. (take_image satellite2 phenomenon11 instrument4 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 4 of 11
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 11
13. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 4 of 11
14. (turn_to satellite0 star13 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star13)
   goals met: 4 of 11
15. (take_image satellite0 star13 instrument0 image0)
   added: (have_image star13 image0)
   goals met: 5 of 11
16. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 5 of 11
17. (take_image satellite0 star14 instrument0 image0)
   added: (have_image star14 image0)
   goals met: 6 of 11
18. (turn_to satellite0 planet10 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 planet10)
   goals met: 7 of 11
19. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 8 of 11
20. (turn_to satellite2 star9 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star9)
   goals met: 8 of 11
21. (take_image satellite2 star9 instrument4 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 9 of 11
22. (turn_to satellite2 star4 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star4)
   goals met: 10 of 11
23. (turn_to satellite4 groundstation5 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 groundstation5)
   goals met: 11 of 11
